Repository: ErikaIwakiri/DebianCorpus
Catalog: TmxMerged.tmx
Source language: en_us
Languages: pt_pt

source: For example, the regular user account created during the installation should have permission to play audio and video, print, and manage the system through sudo.
pt_pt: Por exemplo, a conta de usuário(a) normal criada durante a instalação deve ter permissão para reproduzir áudio e vídeo, realizar impressões e gerenciar o sistema por meio do sudo.

source: Also, we would like to keep debconf (the Debian configuration management system) questions to the absolute minimum.
pt_pt: Além disso, gostaríamos de manter as questões do debconf (o sistema de gerenciamento de configuração do Debian) no mínimo absoluto.

source: There is no need to present difficult technical details during the installation.
pt_pt: Não há necessidade de apresentar detalhes técnicos difíceis durante a instalação.

source: Instead, we will try to ensure that debconf questions make sense to the users.
pt_pt: Em vez disso, tentaremos garantir que as questões do debconf façam sentido para os(as) usuários(as).

source: A novice may not even understand what these questions are about.
pt_pt: Um(a) novato(a) pode nem mesmo entender do que tratam essas perguntas.

source: An expert, however, is perfectly happy to configure the desktop environment after the installation is complete.
pt_pt: Um(a) especialista, no entanto, fica perfeitamente feliz em configurar o ambiente desktop após a conclusão da instalação.

source: How you can help
pt_pt: Como você pode ajudar

source: We're looking for motivated people who make things happen.
pt_pt: Procuramos pessoas motivadas que fazem as coisas acontecerem.

source: You don't have to be a Debian Developer (DD) to submit patches or make packages.
pt_pt: Você não precisa ser um(a) desenvolvedor(a) Debian (DD) para enviar patches ou fazer pacotes.

source: The core Debian Desktop team will ensure that your work is integrated.
pt_pt: A equipe central do Debian Desktop irá garantir que seu trabalho seja integrado.

source: So, here are some things you can do to help:
pt_pt: Então, aqui estão algumas coisas que você pode fazer para ajudar:

source: · Test the default desktop environment (or any of the other desktops) for the upcoming release.
pt_pt: · Teste o ambiente de área de trabalho padrão (ou qualquer um dos outros desktops) para a próxima versão.

source: Get one of the testing images and send feedback to the debian-desktop mailing list.
pt_pt: Obtenha uma das imagens teste (testing) e envie feedback (em inglês) para a lista de discussão debian-desktop.

source: · Join the Debian Installer Team and help to improve the debian-installer – the GTK+ frontend needs you.
pt_pt: · Junte-se à equipe do instalador Debian e ajude a melhorar o debian-installer – a interface GTK+ precisa de você.

source: · You can help the Debian GNOME Team, the Debian Qt/KDE Maintainers and Debian KDE Extras Team, or the Debian Xfce Group with packaging, bug fixing, documentation, tests and more.
pt_pt: · Você pode ajudar a equipe GNOME do Debian, os(as) mantenedores(as) Debian Qt/KDE e a equipeDebian KDE Extras, ou o Grupo Debian Xfce com empacotamento, correção de bugs, documentação, testes e muito mais.

source: · Help to improve debconf by lowering the priority of questions or removing unnecessary ones from packages.
pt_pt: · Ajude a melhorar o debconf diminuindo a prioridade das perguntas ou removendo as perguntas desnecessárias dos pacotes.

source: Make the necessary debconf questions easier to understand.
pt_pt: Torne as perguntas necessárias do debconf mais fáceis de entender.

source: · Got some designer skills?
pt_pt: · Tem habilidades de designer?

source: Then why not work on the Debian Desktop Artwork.
pt_pt: Por que não trabalhar no Debian Desktop Artwork.

source: Join us
pt_pt: Junte-se a nós

source: · Wiki: Visit our DebianDesktop Wiki (some articles may be outdated).
pt_pt: · Wiki: visite nossa wiki DebianDesktop (alguns artigos podem estar desatualizados).

source: · Mailing List: Discuss with us on the debian-desktop mailing list.
pt_pt: · Lista de discussão: converse conosco (em inglês) na lista de discussão debian-desktop.

source: · IRC Channel: Chat with us on IRC.
pt_pt: · Canal IRC: converse conosco, em inglês, no IRC.

source: Join the #debian-desktop channel on OFTC IRC (irc.debian.org)
pt_pt: Junte-se ao canal #debian-desktop no OFTC IRC (irc.debian.org)

source: dansk Deutsch español français Italiano 한국어 (Korean) Nederlands polski Português Русский (Russkij) svenska
pt_pt: dansk Deutsch English español français Italiano 한국어 (Korean) Nederlands polski Русский (Russkij) svenska

source: Debian bug tracking system / Debian BTS — developer info
pt_pt: Sistema de Acompanhamento de Bugs Debian / Debian BTS — informações para desenvolvedores(as)

source: Information regarding the bug processing system for package maintainers and bug triagers
pt_pt: Informações sobre o sistema de processamento de bugs para mantenedores(as) de pacotes e classificadores(as) de bugs

source: Initially, a bug report is submitted by a user as an ordinary mail message to submit@bugs.debian.org which must include a Package line (see Bug Reporting Instructions for more information).
pt_pt: Inicialmente, um relatório de bug é enviado por um(a) usuário(a) como uma mensagem de e-mail comum para submit@bugs.debian.org, o qual deve incluir uma linha Package (para mais informações veja instruções para relatar bug).

source: This will then be given a number, acknowledged to the user, and forwarded to debian-bugs-dist.
pt_pt: Um número é então atribuído ao relatório, informado ao(à) usuário(a) e encaminhado para debian-bugs-dist.

source: If the Package line contains a package which has a known maintainer, the maintainer will get a copy too.
pt_pt: Se a linha Package contiver um pacote que tenha um(a) ou mais mantenedores(as) conhecidos(a), eles(as) também receberão uma cópia.

source: The Subject line will have Bug#nnn: added, and the Reply-To will be set to include both the submitter of the report and nnn@bugs.debian.org.
pt_pt: Na campo Assunto será adicionado Bug#nnn: e o campo Responder para incluirá o(a) usuário(a) que enviou o relatório e também nnn@bugs.debian.org.

source: · Closing bug reports
pt_pt: · Fechando relatórios de bugs

source: · Followup messages
pt_pt: · Mensagens de acompanhamento

source: · Severity levels
pt_pt: · Níveis de severidade

source: · Tags for bug reports
pt_pt: · Tags para relatórios de bugs

source: · Recording that you have passed on a bug report
pt_pt: · Registrando que você encaminhou um relatório de bug

source: · Changing bug ownership
pt_pt: · Alterando o responsável pelo bug

source: · Incorrectly listed package maintainers
pt_pt: · Mantenedores(as) de pacotes listados(as) incorretamente

source: · Reopening, reassigning and manipulating bugs
pt_pt: · Reabrindo, reatribuindo e manipulando bugs

source: · Subscribing to bugs
pt_pt: · Inscrevendo-se em um bug

source: · More-or-less obsolete subject-scanning feature
pt_pt: · Recurso mais ou menos obsoleto de procura por assunto

source: · Obsolete X-Debian-PR: quiet feature
pt_pt: · Recurso obsoleto X-Debian-PR: quiet

source: Closing bug reports
pt_pt: Fechando relatórios de bugs

source: Debian bug reports should be closed when the problem is fixed.
pt_pt: Os relatórios de bugs Debian devem ser fechados quando o problema é corrigido.

source: Problems in packages can only be considered fixed once a package that includes the bug fix enters the Debian archive.
pt_pt: Problemas em pacotes só podem ser considerados corrigidos apenas quando um pacote que inclui a correção para o bug entra no repositório Debian.

source: Normally, the only people that should close a bug report are the submitter of the bug and the maintainer(s) of the package against which the bug is filed.
pt_pt: Normalmente, as únicas pessoas que devem fechar um relatório de bug são: o(a) usuário(a) que relatou o bug e os(as) mantenedores(as) do pacote para o qual o bug foi enviado.

source: There are exceptions to this rule, for example, the bugs filed against unknown packages or certain generic pseudo-packages.
pt_pt: Existem exceções para esta regra, por exemplo, os bugs relatados para pacotes desconhecidos ou para certos pseudopacotes genéricos.

source: A bug can also be closed by any contributor if the bug is for an orphaned package or if the maintainer of a package has missed closing it.
pt_pt: Um bug também pode ser fechado por qualquer contribuidor(a) se o bug for de um pacote órfão, ou se o(a) mantenedor(a) do pacote esqueceu de fechá-lo.

source: It is very important to mention the version in which the bug was fixed.
pt_pt: É muito importante mencionar a versão do pacote para a qual o bug foi corrigido.

source: When in doubt, don't close bugs, first ask for advice on the debian-devel mailing list.
pt_pt: Em caso de dúvida, não feche o bug, peça primeiro por ajuda na lista de discussão debian-devel.

source: Bug reports should be closed by sending email to nnn-done@bugs.debian.org.
pt_pt: Relatórios de bugs devem ser fechados através do envio de um e-mail para nnn-done@bugs.debian.org.

source: The message body needs to contain an explanation of how the bug was fixed.
pt_pt: O corpo da mensagem precisa conter uma explicação de como o bug foi corrigido.

source: With the emails received from the bug tracking system, all you need to do to close the bug is to make a Reply in your mail reader program and edit the To field to say nnn-done@bugs.debian.org instead of nnn@bugs.debian.org (nnn-close is provided as an alias for nnn-done).
pt_pt: Com as mensagens recebidas do sistema de acompanhamento de bugs, tudo o que você precisa fazer para fechar o bug é enviar uma resposta através de seu programa de e-mail e editar o campo Para inserindo nnn-done@bugs.debian.org em vez de nnn@bugs.debian.org (nnn-close é fornecido como um apelido para nnn-done).

source: Where applicable, please supply a Version line in the pseudo-header of your message when closing a bug, so that the bug tracking system knows which releases of the package contain the fix.
pt_pt: Onde aplicável, por favor forneça uma linha Version no pseudocabeçalho de sua mensagem quando fechar um bug, de forma que o sistema de acompanhamento de bugs saiba quais versões do pacote contêm a correção.

source: The person closing the bug, the person who submitted it and the debian-bugs-closed mailing list will each get a notification about the change in status of the report.
pt_pt: A pessoa que está fechando o bug, a pessoa que o relatou e a lista de discussão debian-bugs-closed irão todos receber uma notificação sobre a mudança do status do relatório.

source: The submitter and the mailing list will also receive the contents of the message sent to nnn-done.
pt_pt: A pessoa que enviou o relatório e a lista de discussão também receberão o conteúdo da mensagem enviada para nnn-done.

source: Followup messages
pt_pt: Mensagens de acompanhamento

source: The bug tracking system will include the submitter's address and the bug address (nnn@bugs.debian.org) in the Reply-To header after forwarding the bug report.
pt_pt: O sistema de acompanhamento de bugs incluirá o endereço da pessoa que relatou o bug e o endereço do bug (nnn@bugs.debian.org) no cabeçalho Responder para depois de encaminhar o relatório do bug.

source: Please note that these are two distinct addresses.
pt_pt: Por favor, observe que estes são dois endereços distintos.

source: Any developer wishing to reply to a bug report should simply reply to the message, respecting the Reply-To header.
pt_pt: Qualquer desenvolvedor(a) que deseje responder a um relatório de bugs deve simplesmente responder à mensagem, respeitando o cabeçalho Responder para.

source: This will not close the bug.
pt_pt: Isto não fechará o bug.

source: Do not use the reply to all recipients or followup feature of your mailer unless you intend to edit down the recipients substantially.
pt_pt: Não use as funcionalidades responder para todos ou encaminhar do seu leitor de e-mail, a não ser que você deseje editar os destinatários consideravelmente.

source: In particular, see that you don't send followup messages to submit@bugs.debian.org.
pt_pt: Em particular, não envie mensagens encaminhadas para submit@bugs.debian.org.

source: Messages can be sent to the following addresses in order to be filed in the bug tracking system:
pt_pt: As mensagens podem ser enviadas para os seguintes endereços a fim de serem arquivadas no sistema de acompanhamento de bugs:

source: · nnn@bugs.debian.org — such messages are also sent to the package maintainer and forwarded to debian-bugs-dist, but not to the submitter;
pt_pt: · nnn@bugs.debian.org - estas mensagens também são enviadas para o(a) mantenedor(a) do pacote e encaminhadas para debian-bugs-dist, mas não para a pessoa que relatou o bug;

source: · nnn-submitter@bugs.debian.org — these are also sent to the submitter and forwarded to debian-bugs-dist, but not to the package maintainer;
pt_pt: · nnn-submitter@bugs.debian.org - estas também são enviadas para a pessoa que relatou o bug e encaminhadas para debian-bugs-dist, mas não para o(a) mantenedor(a) do pacote;

source: · nnn-maintonly@bugs.debian.org — these are only sent to the package maintainer, not to the submitter or debian-bugs-dist;
pt_pt: · nnn-maintonly@bugs.debian.org - estas são enviados somente para o(a) mantenedor(a) do pacote, e não para a pessoa que relatou o bug ou debian-bugs-dist;

source: · nnn-quiet@bugs.debian.org — these are only filed in the bug tracking system (as are all the above), not sent to anyone else.
pt_pt: · nnn-quiet@bugs.debian.org - estas são apenas arquivadas no sistema de acompanhamento de bug (como todos os anteriores), e não são enviadas para mais ninguém.

source: For more information about headers to suppress ACK messages and how to send carbon copies using the Bug Tracking System, see the instructions for reporting bugs.
pt_pt: Para mais informações sobre cabeçalhos para suprimir mensagens de confirmação e como enviar com cópias usando o sistema de acompanhamento de bugs, veja as instruções para relatar bugs.

source: The bug system records a severity level with each bug report.
pt_pt: O sistema de acompanhamento de bugs grava um nível de severidade para cada relatório de bug.

source: This is set to normal by default, but can be overridden either by supplying a Severity line in the pseudo-header when the bug is submitted (see the instructions for reporting bugs), or by using the severity command with the control request server.
pt_pt: Este é definido como normal por padrão, mas pode ser sobrescrito incluindo uma linha Severity no pseudocabeçalho quando o bug é enviado (consulte as instruções para reportar bugs), ou usando o comando severity com o servidor de requisição de controle.

source: The severity levels are:
pt_pt: Os níveis de severidade são:

source: makes unrelated software on the system (or the whole system) break, or causes serious data loss, or introduces a security hole on systems where you install the package.
pt_pt: faz com que o software não relacionado ao sistema (ou o sistema todo) pare, ou causa sérias perdas de dados, ou introduz uma falha de segurança nos sistemas onde você instala o pacote.

source: makes the package in question unusable or mostly so, or causes data loss, or introduces a security hole allowing access to the accounts of users who use the package.
pt_pt: torna o pacote em questão inutilizável ou quase inutilizável, ou causa perda de dados, ou introduz uma falha de segurança, permitindo acesso às contas dos(as) usuários(as) que utilizam o pacote.

source: is a severe violation of Debian policy (roughly, it violates a must or required directive), or, in the package maintainer's or release manager's opinion, makes the package unsuitable for release.
pt_pt: é uma violação severa da política Debian (praticamente, viola uma diretiva must ou required, ou, na opinião do(a) mantenedor(a) do pacote ou do(a) gerente de lançamento, torna o pacote impróprio para o lançamento.

source: a bug which has a major effect on the usability of a package, without rendering it completely unusable to everyone.
pt_pt: um bug que tem um efeito maior na utilização de um pacote, sem torná-lo completamente inutilizável para todos(as).

source: the default value, applicable to most bugs.
pt_pt: o valor padrão, aplicável à maioria dos bugs.

source: a problem which doesn't affect the package's usefulness, and is presumably trivial to fix.
pt_pt: um problema que não afeta a utilidade do pacote, e de correção presumivelmente trivial.

source: for any feature request, and also for any bugs that are very difficult to fix due to major design considerations.
pt_pt: para requisição de qualquer melhoria, e também para quaisquer bugs que sejam muito difíceis de corrigir devido a grandes considerações de design.

source: Certain severities are considered release-critical, meaning the bug will have an impact on releasing the package with the stable release of Debian.
pt_pt: Certas severidades são consideradas release-critical, significando que o bug terá um impacto na liberação do pacote na versão estável (stable) do Debian.

source: Currently, these are critical, grave and serious.
pt_pt: Atualmente, as severidades nesta categoria são critical, grave e serious.

source: For complete and canonical rules on what issues merit these severities, see the list of release-critical issues for the next release.
pt_pt: Para regras completas e canônicas sobre quais problemas merecem tais severidades, veja a lista dos problemas release-critical para o próximo lançamento

source: Tags for bug reports
pt_pt: Tags para relatórios de bugs

source: Each bug can have zero or more of a set of given tags.
pt_pt: Cada bug pode ter zero ou mais conjunto de tags.

source: These tags are displayed in the list of bugs when you look at a package's page, and when you look at the full bug log.
pt_pt: Estas tags são exibidas na lista de bugs quando você consulta a página do pacote e quando você consulta o registro completo do bug.

source: Tags can be set by supplying a Tags line in the pseudo-header when the bug is submitted (see the instructions for reporting bugs), or by using the tags command with the control request server.
pt_pt: As tags podem ser definidas incluindo uma linha Tags no pseudocabeçalho quando o bug é reportado (consulte as instruções para reportar bugs) ou usando o comando tags com o servidor de requisição de controle.

source: Separate multiple tags with commas, spaces, or both.
pt_pt: Separe tags múltiplas com vírgulas, espaços ou ambos.

source: The current bug tags are: patch, wontfix, moreinfo, unreproducible, help, security, upstream, pending, confirmed, ipv6, lfs, d-i, l10n, newcomer, a11y, ftbfs, fixed-upstream, fixed, fixed-in-experimental, potato, woody, sarge, etch, lenny, squeeze, wheezy, jessie, stretch, buster, bullseye, bookworm, trixie, forky, sid, experimental, sarge-ignore, etch-ignore, lenny-ignore, squeeze-ignore, wheezy-ignore, jessie-ignore, stretch-ignore, buster-ignore, bullseye-ignore, bookworm-ignore, trixie-ignore forky-ignore .
pt_pt: As tags atuais dos bugs são: patch, wontfix, moreinfo, unreproducible, help, security, upstream, pending, confirmed, ipv6, lfs, d-i, l10n, newcomer, a11y, ftbfs, fixed-upstream, fixed, fixed-in-experimental, potato, woody, sarge, etch, lenny, squeeze, wheezy, jessie, stretch, buster, bullseye, bookworm, trixie, forky, sid, experimental, sarge-ignore, etch-ignore, lenny-ignore, squeeze-ignore, wheezy-ignore, jessie-ignore, stretch-ignore, buster-ignore, bullseye-ignore, bookworm-ignore, trixie-ignore forky-ignore .

source: Here is some detailed info about the tags:
pt_pt: Aqui estão algumas informações detalhadas sobre as tags:

source: A patch or some other easy procedure for fixing the bug is included in the bug logs.
pt_pt: Um patch (correção) ou outro procedimento fácil para corrigir o bug é incluído nos registros do bug.

source: If there's a patch, but it doesn't resolve the bug adequately or causes some other problems, this tag should not be used.
pt_pt: Caso exista um patch, mas o mesmo não corrija o bug adequadamente ou cause outros problemas, esta tag não deve ser usada.

source: This bug won't be fixed.
pt_pt: Este bug não será corrigido.

source: Possibly because this is a choice between two arbitrary ways of doing things and the maintainer and submitter prefer different ways of doing things, possibly because changing the behaviour will cause other, worse, problems for others, or possibly for other reasons.
pt_pt: Possivelmente porque esta é uma escolha entre duas maneiras arbitrárias de fazer as coisas, e o(a) mantenedor(a) e a pessoa que relatou o bug preferem maneiras diferentes de fazer as coisas, possivelmente porque a mudança de comportamento causará outros problemas piores para os outros, ou possivelmente por outras razões.

source: This bug can't be addressed until more information is provided by the submitter.
pt_pt: Este bug não pode ser direcionado até que mais informações sejam fornecidas pela pessoa que relatou o mesmo.

source: The bug will be closed if the submitter doesn't provide more information in a reasonable (few months) timeframe.
pt_pt: O bug será fechado caso a pessoa que o relatou não forneça maiores informações em um período de tempo razoável (alguns meses).

source: This is for bugs like It doesn't work.
pt_pt: Esta é para bugs do tipo Não funciona.

source: What doesn't work?
pt_pt: O que não funciona?

source: This bug can't be reproduced on the maintainer's system.
pt_pt: Este bug não pode ser reproduzido no sistema do(a) mantenedor(a).

source: Assistance from third parties is needed in diagnosing the cause of the problem.
pt_pt: A assistência de terceiros é necessária para diagnosticar a causa do problema.

source: The maintainer is requesting help with dealing with this bug.
pt_pt: O(A) mantenedor(a) está requisitando ajuda para lidar com este bug.

source: Either the maintainer does not have the skills necessary to fix this bug and desires collaboration, or is overloaded and wants to delegate this task.
pt_pt: Ou o(a) mantenedor(a) não tem as habilidades necessárias para corrigir esse bug e necessita de colaboração, ou está sobrecarregado(a) e quer delegar essa tarefa.

source: This bug might not be suitable for new contributors unless it is also tagged with the newcomer tag.
pt_pt: Este bug pode não ser adequado para novos(as) colaboradores(as) a menos que também esteja marcado com a tag newcomer.

source: This bug has a known solution but the maintainer requests someone else implement it.
pt_pt: Este bug tem uma solução conhecida mas o(a) mantenedor(a) solicita que outra pessoa o implemente.

source: This is an ideal task for new contributors who wish to get involved in Debian, or who wish to improve their skills.
pt_pt: Esta é uma tarefa ideal para novos(as) contribuidores(as) que desejam se envolver com o Debian, ou que desejam melhorar suas habilidades.

source: A solution to this bug has been found and an upload will be made soon.
pt_pt: Uma solução para este bug foi encontrada e um envio será feito em breve.

source: This bug is fixed or worked around (by a non-maintainer upload, for example), but there's still an issue that needs to be resolved.
pt_pt: Este bug foi corrigido ou contornado (por exemplo foi enviado por um(a) não mantenedor(a)), mas ainda existe um problema que precisa ser resolvido.

source: This tag replaces the old fixed severity.
pt_pt: Esta tag substitui a antiga severidade fixed.
